#My decision    
#Problem #1. Считаем сумму элементов списка
#Пройтись в цикле по элементам списка и посчитать их сумму.
    
#ФОРМАТ ВВОДА
    
#Программа получает на вход числа через пробел
#ФОРМАТ ВЫВОДА
    
#Сумма элементов списка

list = int(input()), int(input()), int(input())
S = 0
for i in list:
    S = S + i
print(S)

#Teacher's decision
#numbers = input().split()

#sum_of_numbers = 0  

#for number in numbers:
    #sum_of_numbers += int(number) 

#print(sum_of_numbers)  